# 常用：拆分、堆叠列

In [1]:
table = pd.DataFrame({
    'cust_id': [10001, 10001, 10002, 10002, 10003],
    'type':
    ['Normal', 'Special_offer', 'Normal', 'Special_offer', 'Special_offer'],
    'Monetary': [3608, 420, 1894, 3503, 4567]
})
table

   cust_id           type  Monetary
0    10001         Normal      3608
1    10001  Special_offer       420
2    10002         Normal      1894
3    10002  Special_offer      3503
4    10003  Special_offer      4567

## 数据透视表

<span class="burk">这个例子中，`index` 和 `columns` 都是类别变量。</span>

In [3]:
pd.pivot_table(table, index='cust_id', columns='type', values='Monetary')

type     Normal  Special_offer
cust_id
10001    3608.0          420.0
10002    1894.0         3503.0
10003       NaN         4567.0

### 指定缺省值填充、和汇总项的统计方式

In [6]:
pd.pivot_table(
    table,
    index='cust_id',
    columns='type',
    values='Monetary',
    fill_value=0,
    aggfunc='sum')

type     Normal  Special_offer
cust_id
10001      3608            420
10002      1894           3503
10003         0           4567

### reset_index 把索引值单独拿出来作为一个字段

In [9]:
pd.pivot_table(table,index='cust_id',
                        columns='type',
                        values='Monetary',
                        fill_value=0,
                        aggfunc=np.sum)

type     Normal  Special_offer
cust_id
10001      3608            420
10002      1894           3503
10003         0           4567

In [7]:
table1 = pd.pivot_table(table,index='cust_id',
                        columns='type',
                        values='Monetary',
                        fill_value=0,
                        aggfunc=np.sum).reset_index()
table1

type  cust_id  Normal  Special_offer
0       10001    3608            420
1       10002    1894           3503
2       10003       0           4567

## 使用 pandas 的 melt 方法把数据透视表恢复成一条一条的数据

<span class="burk">注意：`melt` 方法返回的结果，只会有一列出现汇总的数值，其余都是类别变量。</span>

In [10]:
pd.melt(
    table1,
    id_vars='cust_id',
    value_vars=['Normal', 'Special_offer'],
    value_name='Monetary',
    var_name='TYPE')

   cust_id           TYPE  Monetary
0    10001         Normal      3608
1    10002         Normal      1894
2    10003         Normal         0
3    10001  Special_offer       420
4    10002  Special_offer      3503
5    10003  Special_offer      4567